{
  "backend/main.mo": "Main Motoko actor for the Sahil Garments ERP backend, defining data types (Product, Order, Invoice, Supplier, Notification, etc.) and mixing in storage, authorization, and approval modules. Contains state machines for entity and invoice statuses with comparison utilities.",
  "feature_evidence.json": "Feature evidence report mapping a single feature (fixing user approval requests not loading in the Request Management module) to its affected files, components, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing each frontend source file's purpose and key changes, serving as a build/change reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, sidebar, charts, and UI components.",
  "frontend/index.html": "Minimal HTML shell for the Sahil Garments ERP React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component managing the authentication and onboarding flow, routing users through login, profile setup, approval pending, and dashboard states based on bootstrap data and identity status.",
  "frontend/src/components/ApprovalPending.tsx": "Component shown to users awaiting or rejected from admin approval, polling bootstrap state every 5 seconds and displaying either a rejection card or a pending-approval card with logout and refresh options.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Layout shell rendered while the app is loading after authentication, showing animated skeleton placeholders for the sidebar, header, and content area with a spinner and loading message.",
  "frontend/src/components/BarcodeGenerator.tsx": "A dialog component that generates and displays Code128 barcodes and QR codes for a given product using canvas elements, with options to download as PNG or PDF.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches unhandled rendering errors and displays a styled error card with details and a reload button.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A sticky header component with the app logo, dark/light theme toggle, and a user dropdown menu showing the user's name, role, and logout option.",
  "frontend/src/components/InitializationError.tsx": "A full-screen error card component shown when the app fails to initialize, providing error details, troubleshooting steps, and a retry button.",
  "frontend/src/components/InvoiceGenerator.tsx": "A component that renders a styled invoice onto an HTML canvas (A4 proportions) for a given invoice, customer, and products, then provides download options as PNG or PDF.",
  "frontend/src/components/LoadingWorkspace.tsx": "A full-screen loading screen with an animated spinner and progress bar shown while the workspace is initializing.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "A dashboard analytics module that displays KPI stats, order status breakdowns, revenue trends, and top products using Recharts charts, with financial data gated to admin/accountant roles.",
  "frontend/src/components/modules/BarcodeModule.tsx": "A barcode/QR scanner module for inventory managers and admins that uses a camera-based QR scanner to look up products and perform stock-in or stock-out operations with a confirmation dialog.",
  "frontend/src/components/modules/CustomersModule.tsx": "A customer management module that lists, searches, creates, and deletes customers, with create access for sales/admin roles and delete access restricted to admins.",
  "frontend/src/components/modules/DashboardHome.tsx": "Renders the main dashboard home page with metrics cards, order status bar chart, recent orders/notifications lists, and role-based financial summaries using data from multiple query hooks.",
  "frontend/src/components/modules/InventoryModule.tsx": "Provides a full inventory management UI with product listing, search, add/edit dialogs, QR/barcode scanning, low-stock alerts, and admin-gated delete functionality.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Generates and displays an inventory report with barcodes for each product, dynamically loading JsBarcode and jsPDF libraries to support PDF export of barcode labels.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays a filterable, sortable invoice history table with search, status/customer/date filters, invoice preview dialog, and an admin-only option to clear all invoices.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Handles invoice creation by letting users select a customer, add product line items with quantity/price validation, calculate GST totals, and trigger stock adjustment after invoice submission.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Displays a list of user notifications sorted by timestamp, with support for marking individual notifications as read and refreshing the list. Shows unread count badge and relative time formatting.",
  "frontend/src/components/modules/OrdersModule.tsx": "Provides an orders management UI with filtering, search, and order creation via a dialog form. Handles role-based access for admin/sales/accountant users and validates stock availability before submitting.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Renders a profit and loss report for admin/accountant roles with configurable date ranges (daily/monthly/quarterly/yearly) and a bar chart visualization. Includes placeholder export actions for PDF and Excel.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates business reports including daily/monthly sales summaries and low-stock alerts, and embeds ProfitLossModule and InventoryReportModule as tabs. Access is restricted to admin and accountant roles.",
  "frontend/src/components/modules/RequestManagementModule.tsx": "Admin-only module for reviewing user registration requests, allowing approval or rejection of pending users filtered by status. Displays request details in a table with role labels and status badges.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "React component for managing the secondary admin email allowlist, restricted to primary admins. Provides UI to add and remove allowed emails with validation and confirmation dialogs.",
  "frontend/src/components/modules/UserManagementModule.tsx": "React component for admin user management, allowing role assignment, user approval/rejection, and account deletion. Restricted to admin-role users and displays all user profiles in a table.",
  "frontend/src/components/ProfileSetup.tsx": "A form component that collects user profile information (name, email, department, role) and submits it by saving the profile and optionally requesting admin approval based on the selected role.",
  "frontend/src/components/Sidebar.tsx": "A responsive sidebar navigation component that renders role-filtered menu items, supports mobile toggle with overlay, and highlights the active module.",
  "frontend/src/context/PollingContext.tsx": "React context that controls polling behavior based on dashboard activity and browser tab visibility. Exposes shouldPoll flag and helpers to enable/disable polling and track the active module.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query. Invalidates and refetches all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider for Internet Identity authentication using the DFINITY AuthClient. Exposes identity, login/clear functions, and login status flags via React context.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks wrapping all backend actor calls, covering bootstrap state, user profiles, roles, approvals, and CRUD operations for products, customers, orders, and more.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining light and dark theme CSS variables (gold/black palette) and GPU-optimized keyframe animations for fade-in, pulse, and loading effects.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider contexts.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that renders a role-based layout with lazy-loaded module components, controlling access per AppRole.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, showing loading and error states during the login flow.",
  "frontend/src/utils/approvalErrors.ts": "Utility that parses backend approval/user-management errors into typed, user-friendly English messages with detailed console logging.",
  "frontend/src/utils/invoiceDocument.ts": "Constants and helper functions for building and formatting invoice documents, including layout values, currency/date formatting, and line item calculation.",
  "frontend/src/utils/stockErrors.ts": "Utility that detects insufficient-stock backend errors and formats them into clear user-facing messages with available/requested quantity details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom OKLCH-based color tokens, border radius, box shadows, accordion animations, and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 3), recording a known issue where approval requests are not loading in the Request Management module and listing existing and pending fix features targeting backend query and frontend rendering corrections."
}