{
  "backend/main.mo": "Main Motoko actor for the Sahil Garments ERP system defining all core data types (Product, Order, Invoice, Supplier, Notification, etc.) and including mixins for storage and authorization. Contains state management and business logic for inventory, orders, invoices, users, and approval workflows.",
  "backend/migration.mo": "Motoko migration module (version 3.0) that transforms the old actor state to the new actor state by resetting all approval request timestamps to the current time while preserving all other fields.",
  "feature_evidence.json": "Feature evidence report mapping three features (profile setup flow fix, user management module fix, and approval pending screen fix) to their relevant frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated text file containing one-sentence summaries of each frontend source file, describing the purpose and key fixes applied to each component, hook, and page in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for the design system's color tokens in both light and dark themes, including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app titled 'Sahil Garments ERP System' that mounts the React app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component that orchestrates application routing through sequential states: identity initialization, login, bootstrap loading, profile setup, approval pending, and dashboard, using React Query to manage backend state.",
  "frontend/src/components/ApprovalPending.tsx": "Approval waiting screen that auto-polls the backend every 15 seconds to detect when a user is approved, then invalidates bootstrap state and redirects to the dashboard via the onApproved callback.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "A layout shell component for authenticated users featuring a sidebar placeholder, sticky header with logo/theme toggle, and a main content area that shows a loading spinner or children based on the isLoading prop.",
  "frontend/src/components/BarcodeGenerator.tsx": "A dialog component that generates and displays Code128 barcodes and QR codes for a given product using JsBarcode and a QR library, with options to download as PNG or PDF.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches unhandled render errors and displays a styled error card with error details and a reload button.",
  "frontend/src/components/Footer.tsx": "A simple footer component that renders a copyright notice with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A sticky top header component showing the app logo, theme toggle, notifications bell with unread badge, and a user dropdown menu with role display and logout functionality.",
  "frontend/src/components/InitializationError.tsx": "A full-screen error card component displayed when app initialization fails, showing the error message, troubleshooting steps, and a retry button.",
  "frontend/src/components/InvoiceGenerator.tsx": "Renders an invoice onto an HTML5 canvas (A4 proportions) using preloaded logo, customer/product data, and signature, then exposes download buttons for PNG image and PDF exports.",
  "frontend/src/components/LoadingWorkspace.tsx": "Displays a full-screen loading spinner while the app initializes, and switches to a timeout/retry screen after 20 seconds if loading hasn't completed.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics including order status breakdowns, monthly revenue trends, and top products using Recharts bar, line, and pie charts, with financial data gated to admin/accountant roles.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides a QR/barcode scanner interface for inventory managers and admins to perform stock-in or stock-out operations by scanning product barcodes and confirming quantity changes via a dialog.",
  "frontend/src/components/modules/CustomersModule.tsx": "React component for managing customers, providing a searchable table with create and delete functionality, role-based access control (admin/sales), and confirmation dialogs for destructive actions.",
  "frontend/src/components/modules/DashboardHome.tsx": "Dashboard overview component that aggregates and displays key business metrics including orders, customers, products, invoices, and notifications, with a bar chart for order status distribution and role-based financial data visibility.",
  "frontend/src/components/modules/InventoryModule.tsx": "Inventory management component supporting product listing, creation, editing, barcode generation, and QR code scanning, with role-based access for admins and inventory managers.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Report module that generates and displays a product inventory table with barcodes, dynamically loading JsBarcode and jsPDF libraries to support PDF export of barcode labels.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Invoice history component with filtering, sorting, and search across invoices by customer, status, and date, supporting invoice preview, CSV/PDF export, and admin-only bulk clear functionality.",
  "frontend/src/components/modules/InvoiceModule.tsx": "React component for creating invoices by selecting a customer, adding product line items with quantity/price, calculating GST totals, and triggering stock adjustment after invoice creation. Displays a preview via InvoiceGenerator once the invoice is successfully created.",
  "frontend/src/components/modules/NotificationsModule.tsx": "React component that lists user notifications with contextual icons and color-coded backgrounds, supporting mark-as-read and delete actions per notification using query hooks.",
  "frontend/src/components/modules/OrdersModule.tsx": "React component for viewing, searching, filtering, and creating orders, with role-based access control for admin/sales/accountant users and real-time stock validation before order submission.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "React component that fetches and displays a profit & loss report for a selected date range (daily/monthly/quarterly/yearly) with a bar chart visualization and stub PDF/Excel export actions, restricted to admin and accountant roles.",
  "frontend/src/components/modules/ReportsModule.tsx": "React component that aggregates daily/monthly sales summaries and low-stock alerts from orders and inventory data, and embeds ProfitLossModule and InventoryReportModule in tabs, restricted to admin and accountant roles.",
  "frontend/src/components/modules/RequestManagementModule.tsx": "Admin module for viewing and managing user approval requests, supporting filtering by status and per-row approve/reject actions with profile details fetched per user.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Primary-admin-only module for managing an email allowlist that controls who can register as a secondary admin, with add/remove functionality and confirmation dialogs.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Admin module that lists all user profiles with their approval status, allowing admins to approve, reject, change roles, or permanently delete users.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for new users to enter their name, email, and department, then saves their profile with a default sales role and submits an approval request to the backend.",
  "frontend/src/components/Sidebar.tsx": "Renders a responsive navigation sidebar with role-based menu item visibility, supporting both mobile (overlay drawer) and desktop (fixed) layouts.",
  "frontend/src/context/PollingContext.tsx": "React context that tracks whether the dashboard is active and the browser tab is visible, exposing a `shouldPoll` flag to gate data-polling behavior throughout the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated (or anonymous) backend actor using the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that wrap `@dfinity/auth-client` to manage login, logout, and identity persistence with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for all backend interactions including bootstrap state, user profiles, admin checks, and CRUD operations for customers, products, inventory, orders, invoices, notifications, and approval requests.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light/dark themes (gold & black palette), and declares GPU-optimized keyframe animations for loading, fade-in, and pulse effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that lazy-loads feature modules, manages active module state and sidebar visibility, and enforces role-based access control to determine which modules each user can view.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that provides an Internet Identity authentication button with loading and error states, styled with a branded card layout for Sahil Garments.",
  "frontend/src/utils/approvalErrors.ts": "Utility module that parses backend errors from approval and user-management operations into structured, user-friendly error objects categorized by type (authorization, missing-profile, rejected, network, etc.).",
  "frontend/src/utils/invoiceDocument.ts": "Utility module providing constants, types, and helper functions for building and formatting invoice documents, including currency/date formatting, line item construction, and totals calculation.",
  "frontend/src/utils/stockErrors.ts": "Utility that parses unknown errors to detect insufficient-stock conditions and formats them into user-friendly English messages with optional quantity details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens, border radii, accordion keyframes, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state manifest for 'Sahil Garments ERP' tracking existing fix features (profile setup, user management, approval polling) and two pending action requests around approval-request persistence and approval notifications."
}