{
  "backend/main.mo": "Main Motoko actor for the Sahil Garments ERP backend, defining data types (Product, Order, Invoice, Supplier, Notification, etc.) and mixing in storage, authorization, and user-approval modules.",
  "feature_evidence.json": "Feature evidence report mapping two onboarding-flow fix features (ProfileSetup form submission and App.tsx routing after profile save) to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated text file containing short summaries of each frontend source file, describing the purpose and recent changes of every component, hook, and page in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, sidebar, charts, and UI primitives.",
  "frontend/index.html": "HTML entry point for the Sahil Garments ERP React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing authentication and onboarding routing; shows LoadingWorkspace during bootstrap fetch/refetch, then conditionally renders LoginPage, ProfileSetup, ApprovalPending, or the Dashboard based on bootstrap state.",
  "frontend/src/components/ApprovalPending.tsx": "Component shown to users awaiting admin approval; polls bootstrap state every 5 seconds and displays either a rejection card or a pending-approval card with logout and refresh options.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "A layout shell component for authenticated users featuring a sidebar placeholder, sticky header with logo and theme toggle, main content area with loading spinner, and a footer placeholder.",
  "frontend/src/components/BarcodeGenerator.tsx": "A dialog component that generates and displays Code128 barcodes and QR codes for a given product using JsBarcode and a QR library, with download and PDF export options.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches unhandled render errors and displays a styled error card with details and a reload button.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying a copyright notice and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A sticky header component with the app logo, theme toggle, and a user dropdown menu showing the user's name, role, and logout option.",
  "frontend/src/components/InitializationError.tsx": "An error screen component shown when app initialization fails, displaying the error message, troubleshooting steps, and a retry button.",
  "frontend/src/components/InvoiceGenerator.tsx": "Renders an invoice onto an HTML5 canvas element and provides buttons to download it as a PNG image or PDF. Uses utility functions for layout, formatting, and line-item calculations, and optionally overlays a signature and company logo.",
  "frontend/src/components/LoadingWorkspace.tsx": "Displays a full-screen animated loading screen with a spinner, heading, and progress bar while the workspace data is being fetched.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics including summary stat cards, revenue over time, orders by status, and top products using Recharts bar, line, and pie charts.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides a QR/barcode scanner interface for inventory managers to scan product barcodes and confirm stock-in or stock-out operations with a confirmation dialog.",
  "frontend/src/components/modules/CustomersModule.tsx": "React component for managing customers, providing a searchable table with create and delete functionality, role-based access control (admin/sales), and confirmation dialogs for destructive actions.",
  "frontend/src/components/modules/DashboardHome.tsx": "Dashboard overview component that aggregates and displays key business metrics including orders, customers, products, invoices, and notifications, with a bar chart for order status distribution and role-based financial data visibility.",
  "frontend/src/components/modules/InventoryModule.tsx": "Inventory management component supporting product listing, creation, editing, barcode generation, and QR code scanning, with role-based access for admin and inventory manager roles.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Report module that generates and displays a product inventory table with barcodes, dynamically loading JsBarcode and jsPDF libraries to support PDF export of the inventory report.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Invoice history component with filtering by customer, status, and date, sortable table display, invoice preview dialog, CSV/PDF export, and an admin-only option to clear all invoices.",
  "frontend/src/components/modules/InvoiceModule.tsx": "React component for creating invoices by selecting a customer and adding product line items, then calling backend mutations to create the invoice and adjust stock, with a preview/print step via InvoiceGenerator.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Displays a sorted list of system notifications with unread highlighting, relative timestamps, and a button to mark individual notifications as read.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages orders with a searchable/filterable table, a dialog form to create new orders with stock validation, and an admin-only option to delete all orders.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Renders a Profit & Loss report for admin/accountant roles with selectable date ranges (daily to yearly), a bar chart visualization via Recharts, and stub PDF/Excel export actions.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates business reports for admin/accountant roles, showing daily and monthly sales summaries, low-stock alerts, and embedding ProfitLossModule and InventoryReportModule in tabs.",
  "frontend/src/components/modules/RequestManagementModule.tsx": "Admin-only React module for reviewing and managing user approval requests, supporting filtering by status and approve/reject actions via mutations.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Primary-admin-only React module for managing an email allowlist that controls who can register as a secondary admin, with add/remove functionality and confirmation dialogs.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Admin-only React module for managing all user profiles, supporting role assignment, approval/rejection, and permanent account removal with confirmation dialogs.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a form for new users to enter their name, email, and department, then saves the profile and submits an admin approval request using mutation hooks.",
  "frontend/src/components/Sidebar.tsx": "Renders a responsive navigation sidebar with role-based menu item visibility, supporting both mobile (overlay drawer) and desktop layouts.",
  "frontend/src/context/PollingContext.tsx": "React context provider that tracks dashboard activity and tab visibility to control whether data polling should be active, exposing a `shouldPoll` flag and related helpers.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that manage Internet Identity authentication via `AuthClient`, exposing login/logout functions, identity state, and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for all backend interactions including bootstrap state, user profiles, admin/approval checks, and data entities like products, orders, inventory, invoices, and notifications.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light/dark themes (gold & black palette), and declares GPU-optimized keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that renders a sidebar/header layout and lazily loads role-gated feature modules based on the authenticated user's app role.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that triggers Internet Identity authentication and displays loading/error states during the login flow.",
  "frontend/src/utils/approvalErrors.ts": "Utility module that parses raw backend errors from approval and user-management operations into structured, user-friendly error objects with categorized types.",
  "frontend/src/utils/invoiceDocument.ts": "Utility module providing constants, formatting helpers, and functions to build line items and calculate totals for rendering Sahil Garments invoice documents.",
  "frontend/src/utils/stockErrors.ts": "Utility that parses unknown errors to detect insufficient-stock conditions and formats them into user-friendly English messages with optional quantity details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom OKLCH-based color tokens (including sidebar and invoice-gold), border radius, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for Sahil Garments ERP tracking known issues (broken profile-setup/completion flow), existing fix features, and a pending backend audit requirement for the saveProfile endpoint."
}