{
  "backend/main.mo": "Main actor for the Sahil Garments ERP backend, defining all core data types (Product, Order, Invoice, Supplier, Notification, etc.) and including mixins for storage and authorization. Implements the full business logic for inventory, orders, invoices, customers, user management, and reporting.",
  "backend/migration.mo": "Defines the canonical stable state shape (NewActor) for the backend canister and exports a no-op `run` migration function that returns the existing state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping two implemented frontend features—User Management role/status display with misconfiguration badges and Request Management module with filter controls—to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated documentation file containing one-sentence summaries of each frontend source file, describing the purpose and key changes of every component, hook, page, and style file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes, including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML shell for the Vite/React app, setting the page title to 'Sahil Garments ERP System' and mounting the React root via `/src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that orchestrates authentication flow using Internet Identity and bootstrap state, routing users to LoginPage, ProfileSetup, ApprovalPending, InitializationError, or the main Dashboard based on their auth and approval status.",
  "frontend/src/components/ApprovalPending.tsx": "Displays a waiting screen for users whose account is pending admin approval, polling every 5 seconds for status changes, and shows a rejection screen if the account is denied.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Provides a skeleton app shell layout with a sidebar, header (logo, theme toggle), and main content area, showing a loading spinner while content is being fetched.",
  "frontend/src/components/BarcodeGenerator.tsx": "Renders a dialog that generates and displays Code128 and QR code barcodes for a given product using dynamically loaded libraries, with download and PDF export options.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches unhandled render errors and displays an error card with details and a reload button.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a copyright notice with a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Sticky app header showing the Sahil Garments logo, a theme toggle, and a user dropdown menu with role info and logout functionality.",
  "frontend/src/components/InitializationError.tsx": "Displays a full-screen error card when the app fails to initialize, showing network-specific or generic error messages, troubleshooting steps, and a retry button.",
  "frontend/src/components/InvoiceGenerator.tsx": "Renders an invoice onto an HTML5 canvas (A4 proportions) using customer, product, and invoice data, then provides download options for the generated image and PDF.",
  "frontend/src/components/LoadingWorkspace.tsx": "Shows a centered full-screen loading spinner with an animated progress bar while the workspace is initializing.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics including KPI stat cards, revenue trends, order status distribution, and top products using Recharts charts built from orders, inventory, and customer data.",
  "frontend/src/components/modules/BarcodeModule.tsx": "A React component that provides a QR/barcode scanner interface for stock-in and stock-out operations, restricted to admin and inventoryManager roles. It uses camera scanning to find products by barcode and updates their stock levels via a confirmation dialog.",
  "frontend/src/components/modules/CustomersModule.tsx": "A React component for managing customers, displaying a searchable table with create and delete functionality. Create access is limited to admin and sales roles; delete is admin-only, with confirmation dialogs for destructive actions.",
  "frontend/src/components/modules/DashboardHome.tsx": "A dashboard overview component that displays key metrics (orders, customers, products, invoices, notifications) using charts and summary cards. It computes extended metrics like low-stock alerts, unread notifications, and invoice payment status from fetched data.",
  "frontend/src/components/modules/InventoryModule.tsx": "A React component for managing inventory products, supporting add, edit, search, barcode scanning, and barcode generation. Access to create/edit is restricted to admin and inventoryManager roles, and it integrates a QR scanner for barcode lookup.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "A React component that generates a printable/downloadable PDF inventory report with barcodes for all products, dynamically loading JsBarcode and jsPDF from CDN. It validates each product's barcode data and renders barcodes onto canvas elements before exporting.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays a filterable, searchable table of past invoices with status badges, customer/product lookups, and options to preview, export, or clear all invoices. Accessible to admin and sales roles.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Provides a form to create new invoices by selecting a customer and adding product line items, then triggers stock adjustment and displays a generated invoice preview.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Lists all system notifications sorted by recency, showing read/unread state with relative timestamps, and allows marking individual notifications as read or refreshing the list.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages customer orders with a searchable, filterable table and a dialog form to create new orders with real-time stock validation; supports bulk deletion for admins.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Renders a profit and loss report for admin/accountant roles with selectable date ranges (daily to yearly), a bar chart visualization, and PDF/Excel export options.",
  "frontend/src/components/modules/ReportsModule.tsx": "Displays business reports including daily/monthly sales summaries, low stock alerts, and order history, with tabs for profit/loss and inventory reports. Access is restricted to admin and accountant roles.",
  "frontend/src/components/modules/RequestManagementModule.tsx": "Manages user registration requests with filtering by status (pending/approved/rejected) and allows admins to approve or reject users via confirmation dialogs.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Provides a UI for managing a secondary admin email allowlist, allowing admins to add or remove emails that automatically grant secondary admin privileges upon user registration.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Lists all user approvals with their roles and statuses, supports approving/rejecting users, and highlights misconfigured secondary admin accounts where the email is allowlisted but the role is incorrect.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for new users to enter their name, email, department, and role, then saves the profile and submits an approval request via mutation hooks.",
  "frontend/src/components/Sidebar.tsx": "Renders a role-aware navigation sidebar with menu items filtered by user role, admin, or super-admin status, supporting both desktop and mobile layouts.",
  "frontend/src/context/PollingContext.tsx": "Provides a React context that controls data polling behavior, enabling polling only when the dashboard is active and the browser tab is visible.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile management, admin/role checks, and approval workflows using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind CSS base imports, CSS custom properties for light/dark themes (gold & black palette), and GPU-optimized animation keyframes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that lazily loads feature modules (inventory, orders, invoices, etc.) and renders them based on the active sidebar selection, with role-based access control.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that renders a branded card with an Internet Identity login button, handling loading and error states during authentication.",
  "frontend/src/utils/approvalErrors.ts": "Utility module that parses backend errors from approval and user-management operations into structured, user-friendly error objects with categorized types.",
  "frontend/src/utils/invoiceDocument.ts": "Defines constants, types, and helper functions for generating Sahil Garments invoice documents, including color/layout configs, currency/date formatting, line item building, and totals calculation.",
  "frontend/src/utils/stockErrors.ts": "Provides a utility function to detect and parse backend insufficient-stock errors from various error shapes, returning a structured result with a user-friendly message.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (using oklch), border radii, shadows, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current project state including version, architectural notes, known issues, existing features, and pending fix requests related to secondary admin role management and request visibility in the admin panel."
}