{
  "kind": "build_request",
  "title": "Fix: Approval requests not loading in Request Management module",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the issue where user approval requests are not appearing/loading in the Request Management module. Ensure the list of pending, approved, and rejected requests renders correctly for admin users, including proper data fetching, error handling, and loading states.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Request nahi aa raha hai"
        ]
      },
      "acceptanceCriteria": [
        "Admin users can see the list of approval requests in the Request Management module without errors",
        "Pending requests are displayed with correct user details (name, email, role, department)",
        "The module shows an appropriate empty state message when there are no requests",
        "Loading spinner is shown while requests are being fetched",
        "Error state is shown with a retry option if the fetch fails",
        "Approving or rejecting a request updates the list immediately without requiring a page refresh"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify and fix the backend query that returns user approval requests. Ensure the `getApprovalRequests` (or equivalent) backend function returns all requests correctly and is not filtering out valid entries due to a logic bug or stale state after upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Request nahi aa raha hai"
        ]
      },
      "acceptanceCriteria": [
        "Backend returns all stored approval requests when queried by an admin principal",
        "No runtime trap or silent empty result is returned when requests exist in stable storage",
        "Newly submitted approval requests are immediately visible in subsequent query results"
      ]
    }
  ],
  "constraints": [
    "Do not change the authentication flow or Internet Identity integration",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui"
  ],
  "nonGoals": [
    "Adding new features to the Request Management module",
    "Changing the approval workflow or role permission model",
    "UI redesign of the Request Management module"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}