{
  "kind": "build_request",
  "title": "Fix 'Complete Your Profile' setup flow not completing",
  "projectName": "Sahil Garments ERP",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the ProfileSetup form so that submitting profile information (name, email, department, role) successfully saves the profile and advances the user past the setup screen to the next appropriate state (approval pending or dashboard).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "complete your profile complete setup nahi ho raha hai"
        ]
      },
      "acceptanceCriteria": [
        "User can fill in all required fields (name, email, department, role) in the ProfileSetup form",
        "Submitting the form does not leave the user stuck on the profile setup screen",
        "After successful submission, user is navigated to the correct next state: approval pending screen (for roles requiring approval) or dashboard (for roles that do not require approval)",
        "Error messages are displayed clearly if submission fails",
        "No console errors or unhandled promise rejections occur during the profile setup flow"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the App.tsx onboarding flow routing so that after a profile is saved via ProfileSetup, the bootstrap state is re-fetched and the user is correctly transitioned away from the profile-setup screen. Ensure the condition that decides whether to show ProfileSetup, ApprovalPending, or the Dashboard is evaluated correctly after the profile save mutation completes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "complete your profile complete setup nahi ho raha hai"
        ]
      },
      "acceptanceCriteria": [
        "After profile save completes successfully, bootstrap data is invalidated and re-fetched",
        "App.tsx transitions to the correct screen based on the updated bootstrap state",
        "User is never stuck in a loop returning to ProfileSetup after already submitting their profile",
        "ApprovalPending screen is shown for roles that require admin approval",
        "Dashboard is shown for roles that do not require admin approval"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit the backend saveProfile (or equivalent) endpoint in main.mo to ensure it correctly persists the user's profile data and returns a success response. Verify that the profile is associated with the caller's principal and that the stored profile is reflected in subsequent bootstrap/getProfile calls.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "complete your profile complete setup nahi ho raha hai"
        ]
      },
      "acceptanceCriteria": [
        "Calling saveProfile with valid data persists the profile for the caller's principal",
        "A subsequent getBootstrap or getProfile call returns the saved profile data",
        "saveProfile returns a clear error variant if required fields are missing or invalid",
        "No trap or unhandled error occurs during profile save"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths: useInternetIdentity.ts, useActor.ts, main.tsx, and frontend/src/components/ui",
    "Keep all Motoko logic in backend/main.mo (single-actor architecture)"
  ],
  "nonGoals": [
    "Changing the visual design or layout of the ProfileSetup form",
    "Adding new profile fields beyond what already exists",
    "Modifying the approval/rejection logic in RequestManagementModule or UserManagementModule"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}