{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix 'Complete Your Profile' setup flow not completing",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Investigate and fix the ProfileSetup form so that submitting profile information successfully saves the profile and advances the user past the setup screen",
      "acceptanceCriteria": [
        "User can fill in all required fields (name, email, department, role) in the ProfileSetup form",
        "Submitting the form does not leave the user stuck on the profile setup screen",
        "After successful submission, user is navigated to the correct next state: approval pending screen (for roles requiring approval) or dashboard (for roles that do not require approval)",
        "Error messages are displayed clearly if submission fails",
        "No console errors or unhandled promise rejections occur during the profile setup flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileSetup.tsx",
          "operation": "modify",
          "description": "Fix the form submission handler to properly handle the saveCallerUserProfile mutation completion. Ensure that after a successful profile save, the component invalidates the bootstrap state query and triggers a refetch. Add proper error handling with user-friendly error messages displayed in the UI. Verify that the form properly awaits both the saveCallerUserProfile call and the requestApproval call (if needed) before considering the submission complete. Add loading state management to prevent double-submissions."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the App.tsx onboarding flow routing so that after a profile is saved via ProfileSetup, the bootstrap state is re-fetched and the user is correctly transitioned away from the profile-setup screen",
      "acceptanceCriteria": [
        "After profile save completes successfully, bootstrap data is invalidated and re-fetched",
        "App.tsx transitions to the correct screen based on the updated bootstrap state",
        "User is never stuck in a loop returning to ProfileSetup after already submitting their profile",
        "ApprovalPending screen is shown for roles that require admin approval",
        "Dashboard is shown for roles that do not require admin approval"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and fix the onboarding flow logic that determines whether to show ProfileSetup, ApprovalPending, or Dashboard. Ensure that the component properly reacts to changes in the bootstrap state after profile submission. Verify that the useGetBootstrapState query is being used correctly and that its data is up-to-date when making routing decisions. Add logic to ensure that once a profile exists (userProfile is not null), the user is never shown ProfileSetup again. Ensure the condition checks are ordered correctly: first check if userProfile exists, then check approval status, then route accordingly. Add proper handling for the case where bootstrap data is refetching after profile save."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useSaveCallerUserProfile mutation hook to ensure it properly invalidates the bootstrap state query key after a successful profile save. Add explicit query invalidation for ['bootstrapState'] in the onSuccess callback of the mutation. Verify that the mutation is configured to await the invalidation before resolving. Ensure proper error propagation so ProfileSetup can catch and display errors."
        }
      ]
    }
  ]
}