{
  "backend/main.mo": "Main Motoko actor defining core ERP types (Product, Order, Invoice, Inventory, Supplier, Notification) with state enums (EntityState, InvoiceStatus), role-based access control (AppRole), and mixins for authorization, storage, and user approval functionality.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: debugging profile save functionality in ProfileSetup component and adding proper error handling/user feedback for profile setup failures.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx with batched bootstrap queries, useQueries hooks with CRUD operations, Dashboard with lazy loading, and various modules for customers, orders, inventory, analytics, and notifications with role-based access control.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes, including sidebar, chart, and destructive color variables with proper contrast ratios.",
  "frontend/index.html": "HTML entry point for the Sahil Garments ERP System with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow with Internet Identity, bootstrap state fetching, conditional rendering for login/profile setup/approval pending/dashboard states, and rejection error handling with PollingProvider wrapper.",
  "frontend/src/components/ApprovalPending.tsx": "Approval pending screen with polling for approval status changes, rejection state detection, request approval functionality, role display, and logout capability with proper error handling for rejected accounts.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Loading shell component displaying sidebar placeholder, header with logo and theme toggle, animated skeleton loaders, and main content area with optional loading spinner for authenticated workspace initialization.",
  "frontend/src/components/BarcodeGenerator.tsx": "React component that generates and displays Code128 and QR code barcodes for products using JsBarcode and QRCode libraries, with options to download as PNG or PDF. Includes validation, error handling, and dynamic library loading.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, theme toggle (light/dark), and user dropdown menu showing profile info (name, email, department, role) with logout functionality.",
  "frontend/src/components/InvoiceGenerator.tsx": "Generates invoice images on HTML canvas with company logo, customer details, line items table, and totals, using predefined layout constants and formatting utilities. Supports both image and PDF export.",
  "frontend/src/components/LoadingWorkspace.tsx": "Loading screen component with animated spinner and progress bar displayed while the workspace is initializing.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics and performance metrics including revenue charts, order status breakdowns, top products, and key statistics. Restricts financial data access to admin and accountant roles.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides QR/barcode scanning functionality for stock IN/OUT operations using camera. Restricted to admin and inventory manager roles, updates product stock levels upon scan confirmation.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer data with create, search, and delete operations. Create access for admin/sales roles, delete restricted to admins only.",
  "frontend/src/components/modules/DashboardHome.tsx": "Main dashboard displaying key metrics, recent orders, notifications, order status charts, and alerts for low stock and pending invoices. Shows role-appropriate data with financial info restricted to admin/accountant.",
  "frontend/src/components/modules/InventoryModule.tsx": "Manages product inventory with CRUD operations, barcode generation/scanning, and low stock alerts. Create/edit access for admin and inventory manager roles, includes barcode generator component integration.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Displays inventory report with product table and barcode generation functionality. Loads JsBarcode and jsPDF libraries dynamically to generate barcodes for products and export them as PDF or CSV.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Shows invoice history with filtering, sorting, and search capabilities. Provides invoice preview, PDF export, and admin-only bulk deletion functionality with role-based access control.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Creates new invoices by selecting customers and adding product line items. Calculates GST, validates stock availability, and generates invoice preview with automatic stock adjustment.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Displays system notifications with read/unread status, relative timestamps, and refresh functionality. Shows notification count badge and allows marking individual notifications as read.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages orders with creation, filtering, and search features. Validates stock availability before order placement and includes admin-only bulk deletion with role-based permissions.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "React component that displays profit and loss reports with date range filtering (daily/monthly/quarterly/yearly), chart visualizations using Recharts, and export functionality for PDF/Excel. Restricted to admin and accountant roles.",
  "frontend/src/components/modules/ReportsModule.tsx": "Reports dashboard component that aggregates sales metrics, low stock alerts, and recent orders/inventory data. Includes tabs for different report types and integrates ProfitLossModule and InventoryReportModule, restricted to admin/accountant roles.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Admin interface for managing a secondary admin email allowlist, allowing primary admins to add/remove email addresses that will automatically grant secondary admin privileges upon user registration.",
  "frontend/src/components/modules/UserManagementModule.tsx": "User management interface restricted to primary admins for approving/rejecting pending users, assigning app roles, and removing users. Secondary admins are explicitly denied access to this module.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for new users to set up their profile with name, email, department, and role selection, including validation and error handling for profile creation.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar with role-based menu items (dashboard, customers, orders, inventory, analytics, etc.) supporting both desktop and mobile layouts with responsive drawer functionality.",
  "frontend/src/context/PollingContext.tsx": "React context provider that manages polling state based on dashboard activity and browser tab visibility, enabling efficient data refresh only when the user is actively viewing the dashboard.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance with Internet Identity authentication, handling actor initialization with admin tokens and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including bootstrap state, user profiles, customers, orders, inventory, invoices, notifications, and admin functions with configurable polling intervals and cache strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Sahil Garments gold and black theme variables, dark mode support, and GPU-optimized animations for loading, fade-in, and hover effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with lazy-loaded modules (customers, orders, inventory, analytics, invoices, etc.), sidebar navigation, and polling context integration for real-time updates.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that displays Internet Identity authentication UI with loading states and branded Sahil Garments styling.",
  "frontend/src/utils/approvalErrors.ts": "Utility functions to parse and normalize backend approval/authorization errors into user-friendly English messages, handling authorization failures, missing profiles, rejections, and role restrictions.",
  "frontend/src/utils/invoiceDocument.ts": "Defines invoice document utilities including color/layout constants, line item interfaces, and helper functions for currency formatting, date formatting, building line items from products, and calculating invoice totals with GST.",
  "frontend/src/utils/stockErrors.ts": "Provides a utility function to detect and parse backend insufficient-stock errors from various error shapes, converting them into user-friendly English messages with stock quantity details when available.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to store, retrieve, and clear parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for sidebar/invoice components, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file indicating a fix request for profile save functionality issues, with two existing features for debugging profile save and adding error handling, plus one pending requirement to verify the backend setUserProfile endpoint."
}