{
  "backend/main.mo": "Main backend actor defining product, order, inventory, invoice, and notification types plus comparison modules and storage mixins.",
  "backend/migration.mo": "Migration script updating secondary admin email state by normalizing the default email into a set.",
  "feature_evidence.json": "Feature evidence report mapping a specific admin-allowlist feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, modules, and hooks for build planning.",
  "frontend/index.css": "Tailwind-based global styles defining light and dark theme variables and component base styling.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, bootstrap loading, and routing to login, setup, approval, or dashboard.",
  "frontend/src/components/ApprovalPending.tsx": "UI screen for users awaiting admin approval with request-approval and logout actions.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Placeholder app shell shown during bootstrap load, with header, sidebar skeleton, footer, and theme toggle.",
  "frontend/src/components/BarcodeGenerator.tsx": "Generates Code128 and QR barcodes for a product, handling validation, dynamic library loading, and error states within a dialog.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with theme toggle, user menu, branding, and logout handling.",
  "frontend/src/components/InvoiceGenerator.tsx": "Generates an invoice image and PDF using canvas drawing based on invoice, customer, and product data.",
  "frontend/src/components/LoadingWorkspace.tsx": "Shows a full‑screen animated loading interface while the workspace initializes.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics using stats, orders, inventory, and customer data, including revenue trends, product rankings, and status charts. Restricts financial views based on user role.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides barcode scanning for stock in/out operations using camera-based QR scanning. Allows inventory updates with role-based access control and confirmation dialogs.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer records with listing, searching, creating, and deleting, using dialogs and role-based permissions. Shows customer data with form handling and confirmation prompts.",
  "frontend/src/components/modules/DashboardHome.tsx": "Dashboard overview showing metrics, orders, notifications, and status charts with auto-refresh. Access to financial data is restricted based on user role.",
  "frontend/src/components/modules/InventoryModule.tsx": "Manages product inventory including listing, searching, creating, editing, scanning barcodes, and generating barcodes. Supports role-based access and low-stock detection.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Generates barcode canvases for products by dynamically loading JsBarcode and jsPDF, validating product data, and preparing barcodes for export. Manages loading, errors, and cleanup of canvas elements.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays searchable, filterable, and sortable invoice history with customer/product lookups and invoice preview. Handles permission checks, status badges, date filtering, and invoice export actions.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Allows creating invoices by adding items, validating stock, calculating totals, and generating previews. Enforces role-based access and integrates invoice creation and stock adjustment mutations.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Lists notifications with relative timestamps, supports marking items as read and refreshing. Shows loading skeletons and unread counts with simple UI interactions.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages order listing, filtering, and creation with stock validation and role-based permissions. Supports creating new orders, clearing all orders, and displaying order details with status badges.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Handles profit/loss reporting with date-range selection, access control, data fetching, and export actions, including chart rendering.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates various business reports like sales, inventory, and alerts, with role-based access and summary metrics.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Manages a list of secondary admin emails with add/remove functionality, validation, and mutation handling.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Provides full user approval and management tools including filtering, sorting, profile loading, and admin actions.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for new users to enter and save their profile details, including name, email, department, and role.",
  "frontend/src/components/Sidebar.tsx": "Displays a role‑based navigation sidebar with module links, supporting both desktop and mobile layouts.",
  "frontend/src/context/PollingContext.tsx": "Context provider managing dashboard polling state and active module tracking.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, auto-invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, app state, and related backend data with caching and polling integration.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode, and optimized animations for the app UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard layout, loading modules lazily and managing module state, polling, and admin access.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen and handles authentication via Internet Identity.",
  "frontend/src/utils/invoiceDocument.ts": "Contains constants and helper functions for building invoice line items, formatting values, and calculating totals.",
  "frontend/src/utils/stockErrors.ts": "Parses backend stock-related errors and converts them into user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the ERP project's state, including existing features and pending feature requests for admin roles, inventory automation, order‑invoice workflows, and dashboards."
}