{
  "backend/main.mo": "Defines core ERP data types (products, orders, inventory, invoices) and includes state enums plus storage and authorization mixins.",
  "feature_evidence.json": "Lists feature evidence for two frontend approval‑related features with associated files, components, and test references.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing their behavior and feature roles.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/index.html": "Simple HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main app router handling authentication, bootstrap loading, rejection handling, and approved-user transition to the dashboard.",
  "frontend/src/components/ApprovalPending.tsx": "Component that polls approval status, handles request‑approval actions, and shows pending or rejected UI with logout support.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Loading shell UI showing placeholder sidebar/header while authenticated data loads.",
  "frontend/src/components/BarcodeGenerator.tsx": "Generates Code128 and QR barcodes for a product using dynamic libraries and canvas rendering with validation and error handling.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the top navigation bar with logo, theme toggle, user menu, and logout handling.",
  "frontend/src/components/InvoiceGenerator.tsx": "Builds an invoice image and PDF using canvas drawing, product line items, totals, and optional signature.",
  "frontend/src/components/LoadingWorkspace.tsx": "Shows a full‑screen animated loading screen for workspace initialization.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics including order stats, revenue trends, product performance, and access-controlled financial metrics using chart visualizations.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides barcode scanning for inventory stock in/out operations with role-based access and confirmation dialogs to update product quantities.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer records with search, creation, and admin-only deletion, including dialogs and form handling.",
  "frontend/src/components/modules/DashboardHome.tsx": "Shows an overview dashboard with metrics, recent activity, order status charts, and financial indicators based on user role.",
  "frontend/src/components/modules/InventoryModule.tsx": "Handles product inventory management including creation, editing, barcode generation, scanning, and filtering with admin-controlled destructive actions.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Loads products, generates barcodes and PDFs using external libraries, and displays an inventory report with error handling.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays and filters invoice history with search, sorting, previews, and admin actions for clearing invoices.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Creates invoices by selecting customers and products, calculates totals, adjusts stock, and supports invoice preview.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Shows system notifications with timestamps, supports marking as read and refreshing the list.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages orders with creation, filtering, stock validation, and bulk deletion based on user permissions.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Displays profit and loss reports with date-range filtering, charts, exports, and access control for admin/accountant roles.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates multiple business reports including sales, inventory, data entries, and embeds submodules like ProfitLoss and InventoryReport with access control.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Manages a list of secondary admin emails with add/remove operations, validation, and mutation-driven updates.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Provides user management for primary admins, including approval handling, role assignment, and access-restricted UI.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for users to enter and save profile details with validation and mutation handling.",
  "frontend/src/components/Sidebar.tsx": "Renders a role‑based sidebar menu with mobile support and module navigation.",
  "frontend/src/context/PollingContext.tsx": "Context controlling when background polling should run based on dashboard activity, tab visibility, and active module.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query hooks, handling caching, polling, and mutations for user profiles, orders, inventory, and app bootstrap state.",
  "frontend/src/index.css": "Defines Tailwind base layers and a custom light/dark theme with optimized animations and UI transitions.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with lazy‑loaded modules, admin checks, and polling control based on active module.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen that triggers Internet Identity authentication and handles loading states.",
  "frontend/src/utils/approvalErrors.ts": "Parses backend approval errors into user-friendly messages and exposes helpers for detecting rejection or authorization failures.",
  "frontend/src/utils/invoiceDocument.ts": "Provides constants and helper functions for invoice layout, currency/date formatting, line-item building, and total calculations.",
  "frontend/src/utils/stockErrors.ts": "Parses various error shapes to detect insufficient-stock issues and formats a user-friendly message with optional stock/requested quantities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters for routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Stores project metadata, feature definitions, pending requests, and state versioning for the user management workflow updates."
}