{
  "backend/main.mo": "Main backend actor defining ERP data types (Product, Order, Invoice, Inventory, Supplier, Notification) with status enums, including MixinAuthorization for access control, MixinStorage for blob storage, and UserApproval for user approval workflows.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for user removal functionality: UI button with confirmation dialog, React Query mutation hook, and self-removal prevention logic.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing batched bootstrap queries, polling optimization, module-specific hooks, role-based access control, and UI components for the ERP system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Sahil Garments ERP System with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, bootstrap state fetching, and conditional rendering of LoginPage, ProfileSetup, ApprovalPending, or Dashboard with PollingProvider wrapper.",
  "frontend/src/components/ApprovalPending.tsx": "Approval pending screen with polling for approval status updates, handling rejected state, displaying user profile info, and providing request approval and logout actions.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Loading shell component with skeleton UI showing sidebar placeholder, header with theme toggle, and animated loading state for authenticated workspace initialization.",
  "frontend/src/components/BarcodeGenerator.tsx": "React component that generates and displays Code128 and QR code barcodes for products using JsBarcode and QRCode libraries, with options to download as PNG or PDF. Includes validation, error handling, and tabbed interface for switching between barcode types.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with a link to caffeine.ai and a heart icon.",
  "frontend/src/components/Header.tsx": "Header component with logo, theme toggle, and user dropdown menu showing profile info (name, email, department, role) with logout functionality. Includes mobile menu button.",
  "frontend/src/components/InvoiceGenerator.tsx": "Component that generates invoice images on HTML canvas with company branding, customer details, line items table, and totals. Supports logo rendering and prepares data for PDF export.",
  "frontend/src/components/LoadingWorkspace.tsx": "Loading screen component with animated spinner and progress bar displayed while workspace data is being fetched.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics and performance metrics including revenue charts, order status distribution, top products, and key statistics. Implements role-based access control for financial data (admin/accountant only).",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides QR/barcode scanning functionality for stock IN/OUT operations using camera. Restricted to admin and inventoryManager roles, with real-time product lookup and stock level updates.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer data with CRUD operations, search/filter capabilities, and role-based permissions (admin/sales can create, only admin can delete). Displays customer list in a table with contact information.",
  "frontend/src/components/modules/DashboardHome.tsx": "Main dashboard overview showing key metrics, recent orders, notifications, order status charts, and alerts for low stock and pending invoices. Implements role-based visibility for financial data.",
  "frontend/src/components/modules/InventoryModule.tsx": "Comprehensive inventory management with product CRUD operations, barcode generation/scanning, low stock alerts, and bulk delete functionality. Restricted to admin and inventoryManager roles with QR scanner integration.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Displays inventory report with product table and barcode generation. Loads JsBarcode and jsPDF libraries dynamically to generate and export barcodes as PDF, with validation and error handling for product data.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Shows invoice history with filtering by customer, status, and date. Includes search, sorting, preview dialog, CSV export, and admin-only bulk delete functionality with role-based access control.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Creates invoices by selecting customers and adding product line items with quantity validation against stock levels. Calculates GST, creates invoice, adjusts stock, and shows preview with InvoiceGenerator component.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Displays system notifications sorted by timestamp with read/unread status badges. Supports marking notifications as read and manual refresh with relative time formatting.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages orders with create, search, and filter capabilities. Validates stock availability before order creation, shows role-based permissions for sales/admin, and includes admin-only bulk delete with stock error parsing.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Displays profit and loss reports with date range filtering (daily/monthly/quarterly/yearly), visualizations using Recharts bar charts, and export functionality for PDF/Excel. Restricted to admin and accountant roles.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates multiple report types including sales summaries, low stock alerts, and embeds ProfitLossModule and InventoryReportModule with tabbed navigation. Access restricted to admin and accountant roles.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Manages a list of email addresses that automatically grant secondary admin privileges upon user registration, with add/remove functionality and email validation.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Provides user account management including approval/rejection of pending users, role assignment, and user removal. Access restricted to primary admins only (secondary admins cannot access).",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form for new users to enter name, email, department, and select their role (sales, inventory manager, accountant, or admin) before accessing the ERP system.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar with role-based menu items (dashboard, customers, orders, inventory, barcode scanner, invoices, analytics, reports, notifications, user management, admin settings). Supports mobile responsive drawer with overlay.",
  "frontend/src/context/PollingContext.tsx": "React context that manages polling behavior based on dashboard activity and browser tab visibility, providing centralized control for when data queries should actively poll.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, handling actor recreation on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including bootstrap state, user profiles, customers, orders, inventory, invoices, notifications, and admin functions with configurable polling intervals and cache strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Sahil Garments gold and black theme using OKLCH color space, GPU-optimized animations, and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapping the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with lazy-loaded modules (customers, orders, inventory, analytics, invoices, etc.), sidebar navigation, and polling context integration for real-time updates.",
  "frontend/src/pages/LoginPage.tsx": "Login page component with Internet Identity authentication UI, displaying Sahil Garments branding and handling login state transitions.",
  "frontend/src/utils/approvalErrors.ts": "Utility functions for parsing and normalizing backend approval/authorization errors into user-friendly messages, categorizing errors by type (authorization, missing-profile, rejected, unknown).",
  "frontend/src/utils/invoiceDocument.ts": "Defines invoice document constants (colors, layout dimensions), types, and utility functions for formatting currency/dates, building line items from invoice data, and calculating totals with GST.",
  "frontend/src/utils/stockErrors.ts": "Provides a utility function to detect and parse backend insufficient-stock errors from various error shapes, formatting them into user-friendly English messages for display.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (using oklch), container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a user management system feature, listing existing features for user removal with confirmation dialogs and pending feature requests for backend removal methods."
}