{
  "backend/main.mo": "Main backend actor implementing an ERP system with role-based access control, product/inventory/order/invoice management, user approval workflow, blob storage integration, and various business entities including suppliers, notifications, and analytics.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to user management approval requests: fetching/displaying pending requests, debug logging for approval lifecycle, and role-based access control verification.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components including App, hooks, pages, and modules covering authentication, profile setup, dashboard, inventory, orders, customers, analytics, and notifications with enhanced debug logging and role-based access.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Sahil Garments ERP System with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component managing authentication flow, bootstrap state fetching, and routing between login, profile setup, approval pending, and dashboard screens with comprehensive debug logging and error handling for rejected users.",
  "frontend/src/components/ApprovalPending.tsx": "Approval pending screen component displaying user profile information, handling approval request submission, polling for approval status changes, and showing rejected state with appropriate UI feedback.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "A layout shell component for authenticated users with a sidebar, header (logo, theme toggle), main content area with loading state, and footer. Includes placeholder skeleton elements for navigation items.",
  "frontend/src/components/BarcodeGenerator.tsx": "A dialog component that generates and displays Code128 barcodes and QR codes for products using JsBarcode and QR libraries. Supports downloading as images or PDFs with validation and error handling.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright text with a heart icon and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header component with logo, mobile menu button, theme toggle, and user dropdown menu showing profile info and logout. Integrates with Internet Identity authentication.",
  "frontend/src/components/InvoiceGenerator.tsx": "Generates invoice images on HTML canvas with company branding, customer details, line items table, and totals. Supports logo rendering and prepares data for PDF export.",
  "frontend/src/components/LoadingWorkspace.tsx": "A full-screen loading component with animated spinner and progress bar, displayed while the workspace is initializing.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics and performance metrics including revenue charts, order status distribution, top products, and key statistics with role-based financial data access control.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides QR/barcode scanning functionality for inventory management, allowing inventory managers and admins to scan product barcodes and update stock levels (in/out) with confirmation dialogs.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer data with CRUD operations, search/filter functionality, and role-based permissions for creating (sales/admin) and deleting (admin only) customer records.",
  "frontend/src/components/modules/DashboardHome.tsx": "Displays a comprehensive dashboard home screen with key metrics, order status charts, recent orders/notifications, low stock alerts, invoice status, and role-based financial data visibility.",
  "frontend/src/components/modules/InventoryModule.tsx": "Main inventory management component that handles product CRUD operations, QR/barcode scanning, stock level tracking, and warehouse location management with role-based access control.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Generates inventory reports with barcode visualization using JsBarcode library, validates product data, and exports reports to PDF format using jsPDF.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays and filters invoice history with search, customer/status/date filtering, sorting capabilities, invoice preview dialog, and bulk invoice clearing functionality for admin/sales roles.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Creates new invoices by selecting customers and products, calculates GST (18%), manages invoice items, adjusts stock levels, and generates invoice previews.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Displays system notifications with read/unread status, relative timestamps, refresh functionality, and allows marking individual notifications as read.",
  "frontend/src/components/modules/OrdersModule.tsx": "Displays and manages orders with filtering, search, and creation capabilities. Includes role-based access control for creating orders (admin/sales) and viewing financial data (admin/accountant), with stock validation and detailed order status tracking.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Generates profit and loss reports with date range filtering (daily/monthly/quarterly/yearly) and visualizes financial data using bar charts. Restricted to admin and accountant roles with export functionality for PDF and Excel.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates business reports including daily/monthly sales summaries, low stock alerts, and integrates ProfitLossModule and InventoryReportModule. Access restricted to admin and accountant roles.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Manages a list of email addresses that automatically grant secondary admin privileges upon user registration. Provides add/remove functionality with email validation and confirmation dialogs.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Handles user approval workflows, role assignment, and user removal. Restricted to primary admins only (secondary admins cannot access), with manual refresh capability and pending user approval interface.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for new users to set up their profile (name, email, department, role) and request approval for privileged roles. Includes validation and error handling with detailed logging.",
  "frontend/src/components/Sidebar.tsx": "Renders a responsive sidebar navigation component with role-based menu items (dashboard, customers, orders, inventory, analytics, etc.) and handles mobile/desktop layouts with overlay and slide-in transitions.",
  "frontend/src/context/PollingContext.tsx": "Provides global state for controlling data polling behavior based on dashboard activity and browser tab visibility. Enables/disables polling to optimize performance when the app is inactive or hidden.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including bootstrap state, user profiles, customers, orders, inventory, invoices, and admin functions with configurable polling intervals and cache strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Sahil Garments gold and black theme using OKLCH color space, including GPU-optimized animations and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that lazy-loads modules (customers, orders, inventory, analytics, etc.), manages sidebar navigation, and enables polling for real-time updates based on user permissions.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that displays the Sahil Garments branding and provides Internet Identity authentication with loading states.",
  "frontend/src/utils/approvalErrors.ts": "Utility for parsing backend approval/user-management errors into user-friendly messages, handling authorization failures, missing profiles, rejections, role restrictions, and network errors with typed error information.",
  "frontend/src/utils/invoiceDocument.ts": "Invoice document utilities providing constants for Sahil Garments template layout/colors, functions for currency/date formatting, and helpers to build line items and calculate totals from invoice data.",
  "frontend/src/utils/stockErrors.ts": "Utility for detecting and formatting insufficient stock errors from the backend into user-friendly English messages, extracting available/requested quantities when present.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence support and functions to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for sidebar/invoice/chart colors, container queries, typography plugin, and custom animations.",
  "project_state.json": "Project state tracking approval request flow fix, documenting known issue where administrators don't receive approval requests, with existing features for user management and new requirements to verify backend approval record creation."
}