{
  "backend/main.mo": "Main actor defining product, inventory, order, invoice, notification types and status enums with comparison logic, including blob storage and migration mixins.",
  "backend/migration.mo": "Migration script adding a default secondary admin email to the stored set.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file listing summaries of various frontend components and modules.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point mounting the frontend and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, bootstrap loading, and routing to login, profile setup, approval, or dashboard.",
  "frontend/src/components/ApprovalPending.tsx": "Component showing pending-approval UI with request-approval and logout actions.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Placeholder shell layout with loading states, header, and footer used while authenticated content loads.",
  "frontend/src/components/BarcodeGenerator.tsx": "Generates Code128 and QR barcodes for a product using dynamic libraries and canvas rendering with validation and error handling.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the top navigation bar with logo, theme toggle, user menu, and logout handling.",
  "frontend/src/components/InvoiceGenerator.tsx": "Builds invoice images and PDFs by drawing structured invoice data onto a canvas with logo, metadata, line items, and totals.",
  "frontend/src/components/LoadingWorkspace.tsx": "Shows a full-screen animated loading screen for workspace initialization.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Fetches stats, orders, inventory, and customers to render charts and summaries for revenue, order status, and top products with role‑based financial access.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides QR-based barcode scanning to adjust product stock levels with confirmation dialogs and role‑restricted access.",
  "frontend/src/components/modules/CustomersModule.tsx": "Handles listing, searching, creating, and deleting customers with dialogs and permission checks.",
  "frontend/src/components/modules/DashboardHome.tsx": "Displays dashboard metrics, recent orders, notifications, and order‑status charts with auto‑refresh and role‑aware financial visibility.",
  "frontend/src/components/modules/InventoryModule.tsx": "Manages products and inventory with creation, editing, barcode generation, low‑stock alerts, and optional QR scanning for product lookup.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Fetches products, validates data, generates barcodes using JsBarcode, and prepares barcode canvases for reports.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays invoice history with search, filtering, sorting, and invoice preview functionality using customer and product data.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Allows creating invoices by selecting customers and products, validating stock, calculating totals, and previewing invoices.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Lists notifications with timestamps, supports marking as read and refreshing, and shows loading states.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages order listing, filtering, and creation with stock checks, permission gating, and bulk deletion support.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Displays profit and loss reports with date-range selection, charts, and export options, restricting access to admins and accountants.",
  "frontend/src/components/modules/ReportsModule.tsx": "Aggregates sales, inventory, alerts, and financial reports with tabs and metrics, accessible only to admins and accountants.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Provides admin tools for viewing, filtering, and managing user approval statuses with sorting, searching, and confirmation dialogs.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for creating and saving a user profile with validation and role selection.",
  "frontend/src/components/Sidebar.tsx": "Renders a role-based navigation sidebar with mobile and desktop layouts and module selection.",
  "frontend/src/context/PollingContext.tsx": "Manages global polling state for dashboard activity and active modules using React context.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication via Internet Identity, exposing identity state, login/logout, and status tracking through a React provider.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for interacting with backend APIs, covering profiles, orders, inventory, approvals, notifications, and reports with caching and polling logic.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and GPU‑optimized animations and transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard layout, lazy‑loading modules based on active state and syncing with polling context.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login UI and triggers Internet Identity authentication with loading states.",
  "frontend/src/utils/invoiceDocument.ts": "Provides invoice layout constants and helpers for formatting currency, dates, line items, and totals.",
  "frontend/src/utils/stockErrors.ts": "Parses backend stock‑related errors and returns user‑friendly insufficient‑stock messages.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, and clearing URL and session‑based parameters with hash‑routing support.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors from CSS variables and enabling typography, container, and animation plugins.",
  "project_state.json": "Stores the project’s versioned state, high-level ERP description, and a detailed list of implemented features including authentication, access control, user management, admin model, and role-based modules. Serves as a snapshot for tracking functional capabilities across versions."
}