{
  "backend/main.mo": "Main Motoko actor defining core business types (Product, Order, Invoice, Inventory, Supplier, Notification) with state enums, role-based access control (admin, sales, inventoryManager, accountant), and mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing ProfileSetup approval request submission and redirect flow, and adding comprehensive error logging for approval failures.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with bootstrap state routing, ProfileSetup with error logging, Dashboard with lazy loading, and various module components with role-based access control.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Sahil Garments ERP System React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main application component managing authentication flow, bootstrap state fetching, and conditional rendering of LoginPage, ProfileSetup, ApprovalPending, or Dashboard based on user authentication and approval status with comprehensive debug logging.",
  "frontend/src/components/ApprovalPending.tsx": "Approval pending screen with polling for approval status updates, rejection state handling, manual approval request submission, and logout functionality with role-specific UI feedback.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Loading shell component displaying skeleton UI with sidebar placeholder, header with theme toggle, and animated loading state while fetching user data.",
  "frontend/src/components/BarcodeGenerator.tsx": "React component that generates and displays Code128 and QR code barcodes for products using JsBarcode and QRCode libraries, with options to download as PNG or PDF. Includes validation, error handling, and dynamic library loading for barcode generation.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice with a link to caffeine.ai and a heart icon.",
  "frontend/src/components/Header.tsx": "Header component with logo, theme toggle (light/dark), and user dropdown menu showing profile info (name, email, department, role) with logout functionality.",
  "frontend/src/components/InvoiceGenerator.tsx": "Component that generates invoice images and PDFs on HTML canvas, rendering company logo, customer details, line items table, totals, and signature. Uses canvas 2D context to draw A4-proportioned invoice documents.",
  "frontend/src/components/LoadingWorkspace.tsx": "Loading screen component displaying an animated spinner with gradient background and progress bar while workspace data loads.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics and performance metrics including revenue charts, order status distribution, top products, and key statistics. Implements role-based access control for financial data (admin/accountant only).",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides QR/barcode scanning functionality for stock IN/OUT operations using camera. Restricted to admin and inventoryManager roles, updates product stock levels upon scan confirmation.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer data with CRUD operations including search, create (admin/sales), and delete (admin only). Displays customer list in a table with contact information and registration dates.",
  "frontend/src/components/modules/DashboardHome.tsx": "Main dashboard overview showing key metrics, recent orders, notifications, order status charts, and alerts for low stock and pending invoices. Implements role-based visibility for financial data.",
  "frontend/src/components/modules/InventoryModule.tsx": "Comprehensive inventory management with product CRUD operations, barcode generation/scanning, low stock alerts, and bulk delete functionality. Restricted to admin and inventoryManager roles for modifications.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Displays inventory report with product details and generates downloadable PDF reports with barcodes using JsBarcode and jsPDF libraries. Includes barcode generation, validation, CSV export, and error handling for failed barcode generation.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays paginated invoice history with filtering by customer, status, and date, plus search functionality. Includes invoice preview dialog, CSV export, and admin-only bulk delete capability with role-based access control.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Creates new invoices by selecting customers and adding product line items with quantity and pricing. Calculates GST, validates stock availability, adjusts inventory on creation, and generates PDF preview of created invoices.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Displays system notifications sorted by timestamp with read/unread status badges and relative time formatting. Allows marking individual notifications as read and refreshing the notification list.",
  "frontend/src/components/modules/OrdersModule.tsx": "Manages customer orders with creation, filtering by status, and search functionality. Validates stock availability before order placement, includes role-based permissions, and provides admin-only bulk delete with stock error parsing.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "React component that displays profit and loss reports with date range filtering (daily/monthly/quarterly/yearly), chart visualizations using Recharts, and export functionality for PDF/Excel. Restricted to admin and accountant roles.",
  "frontend/src/components/modules/ReportsModule.tsx": "Reports dashboard component that aggregates sales metrics, low stock alerts, and embeds ProfitLossModule and InventoryReportModule. Displays daily/monthly sales summaries and provides export functionality, restricted to admin and accountant roles.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Admin interface for managing secondary admin email allowlist with add/remove functionality and email validation. Allows primary admins to grant limited admin privileges to specific email addresses.",
  "frontend/src/components/modules/UserManagementModule.tsx": "User management interface for primary admins to approve/reject pending users, assign app roles, and remove users. Includes access control that restricts secondary admins from accessing this module.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for new users to set up their profile (name, email, department, role) and request approval for privileged roles. Handles validation, profile saving, and approval request submission with error handling.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar component with role-based menu items (dashboard, customers, orders, inventory, invoices, analytics, etc.) supporting both desktop and mobile views with slide-out drawer on mobile.",
  "frontend/src/context/PollingContext.tsx": "React context provider that manages polling state based on dashboard activity and browser tab visibility. Controls when data queries should actively poll for updates to optimize performance.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance with Internet Identity authentication. Handles actor initialization with admin tokens and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data operations including bootstrap state, user profiles, customers, orders, inventory, invoices, notifications, and admin functions with configurable polling intervals and cache strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom Sahil Garments gold and black theme using OKLCH color space, GPU-optimized animations, and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with lazy-loaded modules (customers, orders, inventory, analytics, invoices, etc.), sidebar navigation, and polling context integration for real-time updates.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that displays Internet Identity authentication UI with loading states and branded card layout.",
  "frontend/src/utils/approvalErrors.ts": "Error parsing utilities that normalize backend approval and user management errors into user-friendly messages, categorizing authorization, network, validation, and role restriction errors.",
  "frontend/src/utils/invoiceDocument.ts": "Defines constants, types, and utility functions for generating invoice documents, including color schemes, layout dimensions, currency/date formatting, and line item calculations for Sahil Garments template.",
  "frontend/src/utils/stockErrors.ts": "Provides utility functions to detect and parse backend insufficient-stock errors from various error shapes, converting them into user-friendly English messages for display in toasts or dialogs.",
  "frontend/src/utils/urlParams.ts": "Contains utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (including OKLCH color space), container settings, border radius variables, animations, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking a fix request for ProfileSetup component where privileged role approval requests are not properly submitting to the backend or redirecting to the ApprovalPending screen."
}