{
  "backend/main.mo": "Main Motoko actor implementing an ERP system with authorization, user approval, blob storage, and business entities (products, orders, invoices, inventory, suppliers, notifications) including role-based access control and various status enums.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: investigating/fixing application initialization failures after Version 49 deployment, and adding comprehensive error boundaries with graceful error handling.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing enhanced error handling, React Query hooks, authentication flows, profile setup, dashboard components, and module implementations with role-based access control.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for UI components including sidebar, charts, and destructive states with custom radius and color tokens.",
  "frontend/index.html": "HTML entry point for the Sahil Garments ERP System with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component managing authentication flow, bootstrap state fetching with retry logic, error boundaries, and conditional rendering of login, profile setup, approval pending, or dashboard based on user state.",
  "frontend/src/components/ApprovalPending.tsx": "Component displaying approval pending or rejection status for users awaiting administrator approval, with polling for state changes, user profile display, and logout functionality.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "A layout shell component for authenticated users with a sidebar, header (logo, theme toggle), main content area with loading state, and footer. Includes responsive design with mobile menu button.",
  "frontend/src/components/BarcodeGenerator.tsx": "A dialog component that generates and displays Code128 barcodes and QR codes for products using JsBarcode and QR code libraries. Supports downloading barcodes as images or PDFs with validation and error handling.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary class component that catches and displays errors with technical details, error messages, and a reload button. Provides user-friendly error recovery UI.",
  "frontend/src/components/Footer.tsx": "A simple footer component displaying copyright information and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Application header with logo, mobile menu toggle, theme switcher, and user dropdown menu showing profile info (name, email, department, role) with logout functionality.",
  "frontend/src/components/InitializationError.tsx": "Error display component for application initialization failures, distinguishing network errors from other issues. Provides retry functionality and troubleshooting suggestions with technical details.",
  "frontend/src/components/InvoiceGenerator.tsx": "React component that generates invoice images and PDFs using HTML5 Canvas, rendering company logo, customer details, line items, totals, and optional signature with A4 proportions and custom styling.",
  "frontend/src/components/LoadingWorkspace.tsx": "Simple loading screen component displaying an animated spinner with gradient background and loading progress bar for workspace initialization.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Analytics dashboard displaying business metrics, charts (revenue trends, order status pie chart, top products), and statistics with role-based access control for financial data.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Barcode scanner module using QR scanner hook to scan product barcodes and update stock levels (in/out) with confirmation dialogs, restricted to inventory managers and admins.",
  "frontend/src/components/modules/CustomersModule.tsx": "React component for managing customers with CRUD operations, search/filter functionality, role-based permissions (admin/sales can create, admin can delete), and displays customer data in a table with contact details.",
  "frontend/src/components/modules/DashboardHome.tsx": "Dashboard home component displaying key metrics (customers, products, orders, revenue), order status charts, recent activity feeds, notifications, and low-stock alerts with role-based visibility for financial data.",
  "frontend/src/components/modules/InventoryModule.tsx": "Inventory management component with product CRUD operations, QR/barcode scanning support, barcode generation, stock level tracking, warehouse location management, and role-based permissions for admin/inventory managers.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Component for generating inventory reports with barcode visualization, validates product data, dynamically loads JsBarcode and jsPDF libraries, and generates PDF reports with barcode canvases for all products.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Invoice history viewer with filtering by customer/status/date, sorting capabilities, invoice preview dialog, bulk clear functionality for admins, and displays invoice details with customer/product lookups and status badges.",
  "frontend/src/components/modules/InvoiceModule.tsx": "React component for creating and managing invoices with customer/product selection, line items, GST calculation, stock validation, and PDF preview generation. Includes stock adjustment on invoice creation and error handling for insufficient inventory.",
  "frontend/src/components/modules/NotificationsModule.tsx": "React component displaying a list of system notifications with read/unread status, timestamp formatting, mark-as-read functionality, and refresh capability. Shows notification count badge and empty state when no notifications exist.",
  "frontend/src/components/modules/OrdersModule.tsx": "React component for managing orders with create/delete operations, customer and product selection, stock validation, search/filter functionality, and role-based access control. Displays orders in a table with status badges and supports bulk deletion for admins.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "React component for generating and visualizing profit & loss reports with configurable date ranges (daily/monthly/quarterly/yearly), bar charts using Recharts, and export functionality to PDF/Excel. Restricted to admin and accountant roles with currency formatting for Indian Rupees.",
  "frontend/src/components/modules/ReportsModule.tsx": "React component providing a tabbed interface for various business reports including sales summaries, low stock alerts, and data entries. Calculates daily/monthly sales metrics and integrates ProfitLossModule and InventoryReportModule with role-based access control for accountants and admins.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "React component for managing secondary admin email allowlist with add/remove functionality, email validation, and toast notifications. Uses custom hooks for CRUD operations and displays loading/error states.",
  "frontend/src/components/modules/UserManagementModule.tsx": "User management dashboard component that handles pending user approvals, role assignments, and user removal. Restricts access to primary admins only and includes manual refresh functionality with query invalidation.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for new users to complete their profile (name, email, department, app role) and request admin approval, with validation and error handling.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar component with role-based menu items (dashboard, customers, orders, inventory, analytics, etc.), supporting both desktop and mobile layouts with overlay.",
  "frontend/src/context/PollingContext.tsx": "React context provider that manages polling state based on dashboard activity and tab visibility. Controls when background data fetching should occur to optimize performance.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with authentication, initializes access control with admin token, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Configures AuthClient with custom options including derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend data fetching including bootstrap state, user profiles, orders, inventory, invoices, and admin operations. Configures polling intervals, cache times, and query invalidation strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color scheme for Sahil Garments (gold/black theme), dark mode support, GPU-optimized animations, and utility classes for smooth transitions and hover effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that manages module routing, lazy-loads feature modules (customers, orders, inventory, analytics, etc.), handles polling lifecycle, and renders header/sidebar/footer layout with role-based access control.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that provides Internet Identity authentication UI with loading states, error handling, and branded card layout for Sahil Garments ERP system.",
  "frontend/src/utils/approvalErrors.ts": "Error parsing utility that normalizes backend approval/user-management errors into user-friendly messages, categorizing them by type (authorization, missing-profile, rejected, network, etc.) with comprehensive logging.",
  "frontend/src/utils/invoiceDocument.ts": "Invoice document utilities providing constants for layout/colors, formatting functions for currency/dates, and helpers to build line items and calculate totals for the Sahil Garments invoice template.",
  "frontend/src/utils/stockErrors.ts": "Utility that detects and parses insufficient stock errors from backend responses, extracting available/requested quantities and formatting them into clear user-facing messages.",
  "frontend/src/utils/urlParams.ts": "URL parameter management utilities supporting both query strings and hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom colors for UI components (sidebar, invoice-gold, chart colors), and includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a fix request for an app initialization failure after Version 49 deployment, with existing features focused on investigating runtime errors and adding error boundaries, plus a pending requirement to verify backend actor initialization."
}