{
  "backend/main.mo": "Defines core ERP data types including products, orders, inventory, invoices, notifications, and multiple status enums, incorporating storage and authorization mixins.",
  "feature_evidence.json": "Lists feature evidence records mapping optimization features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides human‑written summaries for numerous frontend files describing their behavior, features, and performance optimizations.",
  "frontend/index.css": "Sets global Tailwind CSS variables and themes for light and dark modes, configuring color tokens and base styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading the main module script.",
  "frontend/src/App.tsx": "Main application component handling authentication, bootstrap loading, conditional routing, and lazy-loaded views with polling control.",
  "frontend/src/components/ApprovalPending.tsx": "UI for users awaiting admin approval, showing profile details, enabling approval requests, and allowing logout.",
  "frontend/src/components/AuthenticatedAppShell.tsx": "Layout shell with sidebar, header, theme toggle, loading state, and footer placeholders for authenticated pages.",
  "frontend/src/components/BarcodeGenerator.tsx": "Generates Code128 and QR barcodes for a product using dynamic libraries, with validation, error handling, and download options.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with menu button, branding, theme toggle, and user dropdown including logout and profile details.",
  "frontend/src/components/InvoiceGenerator.tsx": "Generates invoice images and PDFs by drawing formatted invoice content onto a canvas, including logo, metadata, customer info, and line items.",
  "frontend/src/components/LoadingWorkspace.tsx": "Full‑screen animated loading screen for workspace initialization.",
  "frontend/src/components/modules/AnalyticsModule.tsx": "Displays business analytics using charts, revenue stats, and order data filtered by user role.",
  "frontend/src/components/modules/BarcodeModule.tsx": "Provides barcode scanning for inventory stock updates with role checks and confirmation dialogs.",
  "frontend/src/components/modules/CustomersModule.tsx": "Manages customer creation, search, listing, and admin‑only deletion.",
  "frontend/src/components/modules/DashboardHome.tsx": "Shows dashboard metrics, recent activity, charts, and alerts based on orders, products, notifications, and invoices.",
  "frontend/src/components/modules/InventoryModule.tsx": "Manages product inventory with listing, search, editing, barcode generation, and QR scanning. Handles product creation, updates, and low‑stock identification.",
  "frontend/src/components/modules/InventoryReportModule.tsx": "Generates barcode canvases and PDF reports for all products using JsBarcode and jsPDF. Validates product data and handles asynchronous library loading.",
  "frontend/src/components/modules/InvoiceHistoryModule.tsx": "Displays searchable, filterable invoice history with status badges and invoice preview. Loads related customer and product data for contextual display.",
  "frontend/src/components/modules/InvoiceModule.tsx": "Creates invoices by adding items, calculating totals, and adjusting stock levels. Supports invoice preview and integration with customer and product lists.",
  "frontend/src/components/modules/NotificationsModule.tsx": "Lists notifications with relative timestamps, marking-as-read, and refresh actions. Sorts notifications by time and displays unread counts.",
  "frontend/src/components/modules/OrdersModule.tsx": "Displays and filters orders, allows order creation with stock checks, and supports admin-only deletion.",
  "frontend/src/components/modules/ProfitLossModule.tsx": "Generates profit/loss reports by date range, displays charts, and supports PDF/Excel export with role-based access.",
  "frontend/src/components/modules/ReportsModule.tsx": "Shows sales, inventory, and data-entry reports with alerts and exports, restricted to admin/accountant roles.",
  "frontend/src/components/modules/SecondaryAdminAllowlistModule.tsx": "Manages a list of secondary admin emails with add/remove actions and validation.",
  "frontend/src/components/modules/UserManagementModule.tsx": "Provides admin-only user approval and role assignment with access restrictions and table display.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating a user profile with fields for name, email, department, and role, submitting via a saveProfile hook.",
  "frontend/src/components/Sidebar.tsx": "Renders a role‑based sidebar with module navigation and mobile support.",
  "frontend/src/context/PollingContext.tsx": "Context managing dashboard polling based on tab visibility and active module state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the user's Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data, including bootstrap state, user profiles, and other app resources with polling and caching.",
  "frontend/src/index.css": "Configures Tailwind CSS theme variables, animations, and UI styling for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard container that loads user profile, admin status, and lazily rendered feature modules with polling integration.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that triggers Internet Identity authentication and displays loading states.",
  "frontend/src/utils/invoiceDocument.ts": "Utility functions and constants for formatting invoice documents, including layout, currency, dates, and line-item calculations.",
  "frontend/src/utils/stockErrors.ts": "Parses various error shapes to detect insufficient-stock cases and returns a boolean flag with a user-friendly message.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based routing values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and containers with plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, feature lists, new feature requests, and current project configuration for performance-focused improvements."
}