{
  "kind": "build_request",
  "title": "Update user management approve/reject workflow with automatic refresh",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the backend always persists a consistent UserAccount approval status when an admin approves/rejects a user, including creating a UserAccount record if one does not already exist (using the existing saved UserProfile for that principal).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "user management reject and approved automatic refers please updated"
        ]
      },
      "acceptanceCriteria": [
        "Calling the existing backend setApproval(user, status) results in userAccounts containing a record for that user principal with approvalStatus matching the requested status (approved/rejected/pending).",
        "If the user has not completed profile setup (no UserProfile saved), setApproval continues to fail with a clear error (no silent creation of placeholder profiles).",
        "After a successful setApproval call, getAllUserAccounts() reflects the updated status without requiring any other backend call/mutation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend User Management module so the users list automatically refreshes after approve/reject actions and reflects status changes without a manual page refresh, including robust error messaging based on backend errors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "user management reject and approved automatic refers please updated"
        ]
      },
      "acceptanceCriteria": [
        "After clicking Approve or Reject in UserManagementModule, the table row updates to the new status within one refresh cycle (via query invalidation and/or polling) and the action buttons update accordingly.",
        "If setApproval fails due to authorization (non-primary admin / secondary admin), show an English toast error that includes the backend message when available.",
        "If setApproval fails because the user has not completed profile setup, show an English toast error indicating the user must complete profile setup before approval can be changed."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend approval gating experience so pending users automatically re-check approval status and transition appropriately: redirect to the dashboard when approved, and show a clear rejected-state screen/message when rejected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "user management reject and approved automatic refers please updated"
        ]
      },
      "acceptanceCriteria": [
        "While on the ApprovalPending screen, the app re-checks approval status periodically and automatically routes the user into the authenticated dashboard when approval becomes true (no manual reload required).",
        "If the backend indicates the user has been rejected (e.g., via the existing rejection authorization error), show an English, user-friendly rejected message and provide a logout button that clears the Internet Identity session.",
        "The periodic approval check stops once the user is approved and routed, or once the user logs out."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not implement a referral/affiliate program or referral codes unless explicitly specified with rules and data fields.",
    "Do not add third-party authentication providers beyond Internet Identity.",
    "Do not introduce external databases or services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}