{
  "kind": "build_request",
  "title": "Improve app performance for faster loading and quicker open time",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Reduce initial page-load work so the app becomes usable as quickly as possible after launch (both on first open and on refresh), while preserving existing authentication/approval flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please fast loading aap  and speed open"
        ]
      },
      "acceptanceCriteria": [
        "When the user is authenticated, the UI shows an immediate app shell (header/sidebar/skeletons) without waiting for non-essential data beyond the existing getBootstrapState call.",
        "No module-specific data queries (orders/inventory/invoices/analytics/reports/etc.) start fetching until the Dashboard page is mounted and a module that needs them is active.",
        "The Login/Profile Setup/Approval Pending screens continue to load via lazy loading (no regression from current Suspense behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Optimize dashboard polling and re-render behavior to reduce CPU/network usage during normal use and especially on app open, including pausing background polling when not needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please fast loading aap  and speed open"
        ]
      },
      "acceptanceCriteria": [
        "Polling is disabled when the user is not on the Dashboard page (e.g., Login/Profile Setup/Approval Pending).",
        "Polling is paused when the browser tab is not visible and resumes when visible again.",
        "React Query refetch intervals are gated by the active module (e.g., Orders polling only runs when the Orders module is active), rather than using a single dashboard-wide boolean only.",
        "The DashboardHome header’s auto-refresh UI no longer triggers a full component re-render every 10 seconds solely to update a timestamp (use query metadata such as dataUpdatedAt or update only when relevant queries refresh)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure large/heavy UI modules and third-party libraries are not part of the initial bundle and are only downloaded when the user navigates to the relevant module or opens the relevant dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please fast loading aap  and speed open"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard modules remain code-split (lazy loaded) and do not get eagerly imported by shared components.",
        "Barcode/invoice/report generation libraries (e.g., jsPDF/JsBarcode/QR-related code) are only loaded when the user opens the corresponding feature, not during initial app bootstrap.",
        "Module loading fallbacks remain lightweight and do not depend on additional heavy libraries."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Keep the backend bootstrap endpoint fast and minimal to support quick app open; avoid adding expensive computations or large data payloads to getBootstrapState.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "please fast loading aap  and speed open"
        ]
      },
      "acceptanceCriteria": [
        "getBootstrapState continues to return only: userProfile, isApproved, and isAdmin (no additional large lists or computed aggregates added).",
        "All work inside getBootstrapState remains O(1) relative to stored dataset sizes (no iteration over products/orders/invoices/customers)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui (these are immutable).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if state schema upgrades are required."
  ],
  "nonGoals": [
    "Do not add new ERP features or change business logic (inventory, orders, invoices, roles) beyond performance-related behavior.",
    "Do not introduce external databases, third-party auth providers, WebSockets, or new backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}