{
  "kind": "build_request",
  "title": "Update secondary (second) admin setup and permissions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend secondary-admin model so the designated secondary admin (by email) is automatically recognized as an admin principal after they complete profile setup, while still being restricted from primary-admin-only actions (e.g., user approvals / user management).",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "please updated second admin"
        ]
      },
      "acceptanceCriteria": [
        "If a user saves a profile whose email is in the secondary admin email allowlist (currently initialized with SECONDARY_ADMIN_EMAIL = \"sahilgarments16@gmail.com\"), that caller principal is added to the backend’s secondaryAdminPrincipals set.",
        "The secondary admin is treated as an admin for normal admin checks (e.g., AccessControl.isAdmin / hasAppRole admin override), but calls guarded by requirePrimaryAdmin continue to fail for secondary admins with the existing error message about primary admin privileges.",
        "Secondary admin state is deterministic across reloads/upgrades according to the existing stable-state approach used by the canister (no regression where the secondary admin loses admin status after an upgrade)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend management APIs for primary admins to update the secondary admin email allowlist (add/remove/list) without changing code constants, and ensure changes take effect for new logins/profile-saves.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "please updated second admin"
        ]
      },
      "acceptanceCriteria": [
        "There are canister methods for primary admins to: (1) list secondary admin emails, (2) add a secondary admin email, and (3) remove a secondary admin email.",
        "All new methods reject calls from secondary admins and non-admins using the same primary-admin restriction behavior as other user-management actions.",
        "When a primary admin adds an email and that user later saves/updates their profile with that email, they become recognized as the secondary admin principal automatically.",
        "Removing an email prevents future automatic secondary-admin assignment for that email; the behavior for already-assigned principals is explicitly defined and implemented (either kept or revoked) and covered by a simple test scenario in acceptance checks/manual QA steps."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Expose secondary admin allowlist management in the frontend for primary admins only (simple UI to view/add/remove secondary admin emails), and ensure secondary admins do not see or cannot access this UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "please updated second admin"
        ]
      },
      "acceptanceCriteria": [
        "A primary admin can navigate to a settings/admin area and see a list of secondary admin emails, add a new email, and remove an existing email with confirmation.",
        "Secondary admins do not see this management UI and cannot access it via direct navigation (route/module should be gated).",
        "All user-facing text added/changed for this feature is in English.",
        "Frontend uses existing React Query patterns (via frontend/src/hooks/useQueries.ts) to call the new backend APIs, including loading and error states."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If the project already has deployed state that relied on a previous secondary-admin default email migration, add/adjust conditional upgrade migration logic so existing deployments retain the current secondary admin email allowlist and do not lose configured secondary admin emails during upgrade.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "please updated second admin"
        ]
      },
      "acceptanceCriteria": [
        "On upgrade, the secondary admin email allowlist is preserved if it already exists in stable state.",
        "If stable state lacks the allowlist (older deployments), it is initialized with the same default used today (SECONDARY_ADMIN_EMAIL = \"sahilgarments16@gmail.com\").",
        "Upgrade does not trap due to missing fields/state related to secondary admin."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo; add backend/migration.mo only if required by upgrade policy).",
    "Do not edit any files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity).",
    "Adding new ERP business features unrelated to secondary admin (inventory/order/invoice workflows are out of scope for this request).",
    "Real-time communication (WebSockets/push) for admin updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}