{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add user removal functionality to user management",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add 'Remove User' button to each user row in the UserManagementModule table with confirmation dialog",
      "acceptanceCriteria": [
        "Remove button appears for each user in the management table",
        "Button is styled with destructive/warning styling to indicate permanent action",
        "Clicking the button opens a confirmation dialog explaining the action is irreversible",
        "Confirmation dialog displays the user's name and email for verification",
        "Only primary admins can see and use the remove button"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/modules/UserManagementModule.tsx",
          "operation": "modify",
          "description": "Add a 'Remove User' button to each user row in the users table. The button should be styled with destructive/warning colors (red/alert styling using shadcn/ui button variant='destructive'). When clicked, open a confirmation dialog that displays the user's name and email, warns that this action is permanent and irreversible, and requires explicit confirmation before proceeding. Only render the remove button for primary admins (check isSuperAdmin from useQueries). Integrate with the useRemoveUser mutation hook for the actual removal operation."
        },
        {
          "path": "frontend/src/components/ui/alert-dialog.tsx",
          "operation": "create",
          "description": "Create a shadcn/ui AlertDialog component for the user removal confirmation. This reusable dialog should include AlertDialogTrigger, AlertDialogContent, AlertDialogHeader, AlertDialogTitle, AlertDialogDescription, AlertDialogFooter, AlertDialogCancel, and AlertDialogAction. Use the destructive variant for the action button to emphasize the permanent nature of deletion."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create a React Query mutation hook for removing users with query invalidation and toast notifications",
      "acceptanceCriteria": [
        "Mutation hook handles loading, success, and error states",
        "On successful removal, the user list query is invalidated and refetched",
        "Success toast notification confirms user removal",
        "Error toast displays if removal fails with appropriate error message"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useRemoveUser mutation hook that calls actor.permanentlyRemoveUserAccount(targetUser: Principal). The mutation should handle loading, success, and error states. On success, invalidate the 'allUserAccounts' query key to trigger a refetch of the user list. Display a success toast notification confirming user removal with the user's name. On error, display an error toast with the backend error message or a user-friendly fallback message. Use useMutation from @tanstack/react-query with appropriate onSuccess and onError callbacks."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Prevent users from removing themselves with frontend guards and error handling",
      "acceptanceCriteria": [
        "Frontend hides or disables the remove button for the current user's own account",
        "Attempting self-removal shows an error message explaining the restriction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/modules/UserManagementModule.tsx",
          "operation": "modify",
          "description": "Add logic to prevent self-removal on the frontend. Compare each user's principal ID with the current user's identity (using identity.getPrincipal().toString() from useInternetIdentity). For the current user's own row, either hide the remove button entirely or render it in a disabled state with a tooltip explaining 'You cannot remove your own account'. If a removal attempt somehow proceeds for the current user (edge case), display an error toast with the message 'Cannot remove your own account to prevent lockout'."
        }
      ]
    }
  ]
}