{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "User approval workflow: auto-refresh for admin actions and pending-user gating",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Auto-refresh User Management list after approve/reject and show robust English error toasts mapped from backend errors.",
      "acceptanceCriteria": [
        "After clicking Approve or Reject in UserManagementModule, the table row updates to the new status within one refresh cycle (via query invalidation and/or polling) and the action buttons update accordingly.",
        "If setApproval fails due to authorization (non-primary admin / secondary admin), show an English toast error that includes the backend message when available.",
        "If setApproval fails because the user has not completed profile setup, show an English toast error indicating the user must complete profile setup before approval can be changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/approvalErrors.ts",
          "operation": "create",
          "description": "Add a small error-normalization utility for approval/user-management flows that extracts a readable backend message (when available) and classifies common cases (authorization/secondary admin, missing profile setup). This will be used to produce English toast messages that reflect backend errors. (Uses the user-approval + authorization flows; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/modules/UserManagementModule.tsx",
          "operation": "modify",
          "description": "Update approve/reject handlers to (1) trigger an immediate refresh cycle after mutation (ensure React Query invalidation/refetch of the users list query key used by useGetAllUserAccounts), and (2) use the new approval error utility to show specific English toast errors for authorization failures and missing-profile failures, including backend message text when present. (Relies on user-approval/authorization behavior; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the user-accounts query used by UserManagementModule is refetched promptly after setApproval succeeds (keep/confirm invalidation of the relevant query keys) and align any approval-related cache keys so the module reflects status changes without manual reload. (Relies on user-approval/authorization behavior; verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve ApprovalPending gating so pending users automatically re-check status, transition to dashboard when approved, and display a rejected-state screen with logout.",
      "acceptanceCriteria": [
        "While on the ApprovalPending screen, the app re-checks approval status periodically and automatically routes the user into the authenticated dashboard when approval becomes true (no manual reload required).",
        "If the backend indicates the user has been rejected (e.g., via the existing rejection authorization error), show an English, user-friendly rejected message and provide a logout button that clears the Internet Identity session.",
        "The periodic approval check stops once the user is approved and routed, or once the user logs out."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust polling behavior for the authenticated bootstrap/approval gating so that when a user is pending (has profile, not approved, not admin) the app periodically refetches the bootstrap state (or approval status) until the state changes; polling must stop once approved/admin (dashboard) or logged out. (Relies on user-approval behavior; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/ApprovalPending.tsx",
          "operation": "modify",
          "description": "Enhance ApprovalPending to automatically re-check approval/rejection state while visible: (1) trigger periodic refresh of the approval/bootstrapped state and transition naturally to Dashboard via App's gating once approved, (2) detect rejected state (prefer a dedicated backend signal if available; otherwise fall back to interpreting backend authorization/rejection errors) and show a clear English rejected message, and (3) provide a logout button that clears the Internet Identity session and clears cached queries; ensure polling stops after approval transition or logout. (Relies on authorization + user-approval behavior; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure App's gating reacts to the periodic refresh by re-rendering from ApprovalPending to Dashboard when bootstrap state changes to approved/admin, and handle bootstrap/approval-related errors in a user-friendly way consistent with the rejected-state UX. (Relies on user-approval/authorization behavior; verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}