{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "ERP system with inventory stock level automation and order-to-invoice workflow, including alerts, linking, and dashboard reporting; also needs secondary admin setup updates.",
  "architectural_notes": [],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-expose-secondary-admin-allowlist-management-in-the-frontend-for-primary-admins-only-simple-ui-to-view-add-remove-secondary-admin-emails-and-ensure-secondary-admins-do-not-see-or-cannot-access-this-ui",
      "title": "Expose secondary admin allowlist management in the frontend for primary admins only (simple UI to view/add/remove secondary admin emails), and ensure secondary admins do not see or cannot access this UI.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update/enable the secondary (second) admin setup (roles/permissions/access)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Auto-reduce inventory stock on sales order confirmation and/or invoice creation with real-time stock updates and insufficient-stock alerts",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Auto-generate invoice from confirmed order (order → invoice merge/auto-fetch customer, items, qty, price; avoid manual re-entry)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Stock level alert system with configurable minimum stock; out-of-stock blocking/warnings and low-stock purchase reminders",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Order ↔ invoice reference linking and status tracking (paid/pending, invoice status visible from order history)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Inventory/Order/Invoice dashboard (total stock summary, low stock list, pending orders, generated invoice count)",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Update the backend secondary-admin model so the designated secondary admin (by email) is automatically recognized as an admin principal after they complete profile setup, while still being restricted from primary-admin-only actions (e.g., user approvals / user management).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-8",
      "summary": "Add backend management APIs for primary admins to update the secondary admin email allowlist (add/remove/list) without changing code constants, and ensure changes take effect for new logins/profile-saves.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-10",
      "summary": "If the project already has deployed state that relied on a previous secondary-admin default email migration, add/adjust conditional upgrade migration logic so existing deployments retain the current secondary admin email allowlist and do not lose configured secondary admin emails during upgrade.",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Sahil Garments ERP",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}